dreamted/TRIO_MR_MD/2.TRIO-MR/appl_stm207_20141204_RvsALC_20151223/STM32F2xx_StdPeriph_Driver_v1212/inc/stm32f2xx_rcc_1208.h
/**
  ******************************************************************************
  * @file    stm32f2xx_rcc.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-April-2011
  * @brief   This file contains all the functions prototypes for the RCC firmware library.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F2xx_RCC_H
#define __STM32F2xx_RCC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

/** @addtogroup STM32F2xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */ 

/* Exported types ------------------------------------------------------------*/
typedef struct
{
	uint32_t SYSCLK_Frequency; /*!<  SYSCLK clock frequency expressed in Hz */
	uint32_t HCLK_Frequency;   /*!<  HCLK clock frequency expressed in Hz */
	uint32_t PCLK1_Frequency;  /*!<  PCLK1 clock frequency expressed in Hz */
	uint32_t PCLK2_Frequency;  /*!<  PCLK2 clock frequency expressed in Hz */
} RCC_ClocksTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCC_Exported_Constants
  * @{
  */
  
/** @defgroup RCC_HSE_configuration 
	@defgroup RCC_CR_BitDefinition
  * @{
  */
#define RCC_HSE_OFF                     ((uint8_t)0x00)
#define RCC_HSE_ON                      ((uint8_t)0x01)
#define RCC_HSE_Bypass                  ((uint8_t)0x05)
#define IS_RCC_HSE(HSE) 				(((HSE) == RCC_HSE_OFF) || ((HSE) == RCC_HSE_ON) || \
                         				((HSE) == RCC_HSE_Bypass))

#define  RCC_CR_HSION                   ((uint32_t)0x00000001)
#define  RCC_CR_HSIRDY                  ((uint32_t)0x00000002)

#define  RCC_CR_HSITRIM                 ((uint32_t)0x000000F8)
#define  RCC_CR_HSITRIM_0               ((uint32_t)0x00000008)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1               ((uint32_t)0x00000010)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2               ((uint32_t)0x00000020)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3               ((uint32_t)0x00000040)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4               ((uint32_t)0x00000080)/*!<Bit 4 */

#define  RCC_CR_HSICAL                  ((uint32_t)0x0000FF00)
#define  RCC_CR_HSICAL_0                ((uint32_t)0x00000100)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                ((uint32_t)0x00000200)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                ((uint32_t)0x00000400)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                ((uint32_t)0x00000800)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                ((uint32_t)0x00001000)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                ((uint32_t)0x00002000)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                ((uint32_t)0x00004000)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                ((uint32_t)0x00008000)/*!<Bit 7 */

#define  RCC_CR_HSEON                   ((uint32_t)0x00010000)
#define  RCC_CR_HSERDY                  ((uint32_t)0x00020000)
#define  RCC_CR_HSEBYP                  ((uint32_t)0x00040000)
#define  RCC_CR_CSSON                   ((uint32_t)0x00080000)
#define  RCC_CR_PLLON                   ((uint32_t)0x01000000)
#define  RCC_CR_PLLRDY                  ((uint32_t)0x02000000)
#define  RCC_CR_PLLI2SON                ((uint32_t)0x04000000)
#define  RCC_CR_PLLI2SRDY               ((uint32_t)0x08000000)

/**
  * @}
  */ 
  
/** @defgroup RCC_PLL_Clock_Source 
  * @{
  */
#define RCC_PLLSource_HSI               ((uint32_t)0x00000000)
#define RCC_PLLSource_HSE               ((uint32_t)0x00400000)
#define IS_RCC_PLL_SOURCE(SOURCE) 		(((SOURCE) == RCC_PLLSource_HSI) || \
                                   		((SOURCE) == RCC_PLLSource_HSE))
#define IS_RCC_PLLM_VALUE(VALUE) 		((VALUE) <= 63)
#define IS_RCC_PLLN_VALUE(VALUE) 		((192 <= (VALUE)) && ((VALUE) <= 432))
#define IS_RCC_PLLP_VALUE(VALUE) 		(((VALUE) == 2) || ((VALUE) == 4) || ((VALUE) == 6) || ((VALUE) == 8))
#define IS_RCC_PLLQ_VALUE(VALUE) 		((4 <= (VALUE)) && ((VALUE) <= 15))
 
#define IS_RCC_PLLI2SN_VALUE(VALUE) 	((192 <= (VALUE)) && ((VALUE) <= 432))
#define IS_RCC_PLLI2SR_VALUE(VALUE) 	((2 <= (VALUE)) && ((VALUE) <= 7))   
/**
  * @}
  */ 
  
/** @defgroup RCC_System_Clock_Source 
  * @{
  */
#define RCC_SYSCLKSource_HSI            ((uint32_t)0x00000000)
#define RCC_SYSCLKSource_HSE            ((uint32_t)0x00000001)
#define RCC_SYSCLKSource_PLLCLK         ((uint32_t)0x00000002)
#define IS_RCC_SYSCLK_SOURCE(SOURCE)	(((SOURCE) == RCC_SYSCLKSource_HSI) || \
                                      	((SOURCE) == RCC_SYSCLKSource_HSE) || \
                                      	((SOURCE) == RCC_SYSCLKSource_PLLCLK))
/**
  * @}
  */ 
  
/** @defgroup RCC_AHB_Clock_Source
  * @{
  */
#define RCC_SYSCLK_Div1                 ((uint32_t)0x00000000)
#define RCC_SYSCLK_Div2                 ((uint32_t)0x00000080)
#define RCC_SYSCLK_Div4                 ((uint32_t)0x00000090)
#define RCC_SYSCLK_Div8                 ((uint32_t)0x000000A0)
#define RCC_SYSCLK_Div16                ((uint32_t)0x000000B0)
#define RCC_SYSCLK_Div64                ((uint32_t)0x000000C0)
#define RCC_SYSCLK_Div128               ((uint32_t)0x000000D0)
#define RCC_SYSCLK_Div256               ((uint32_t)0x000000E0)
#define RCC_SYSCLK_Div512               ((uint32_t)0x000000F0)
#define IS_RCC_HCLK(HCLK) 				(((HCLK) == RCC_SYSCLK_Div1) || ((HCLK) == RCC_SYSCLK_Div2) || \
                           				((HCLK) == RCC_SYSCLK_Div4) || ((HCLK) == RCC_SYSCLK_Div8) || \
                           				((HCLK) == RCC_SYSCLK_Div16) || ((HCLK) == RCC_SYSCLK_Div64) || \
                           				((HCLK) == RCC_SYSCLK_Div128) || ((HCLK) == RCC_SYSCLK_Div256) || \
                           				((HCLK) == RCC_SYSCLK_Div512))
/**
  * @}
  */ 
  
